kenhkythuat/stm32_rbee/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32l0xx_hal.h"
#include "config.h"
#include "string.h"
#include "stdbool.h"
#include "stdio.h"
#include "stdlib.h"
#include <math.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim6;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
char AT_RESET[] = "AT+CRESET\r\n";
char AT_CHECK_A76XX[] = "AT\r\n";
char ATE0[] = "ATE0\r\n";
char AT_CHECK_ESIM[] = "AT+CGREG?\r\n";
char AT_SIGNAL_SIM[] = "AT+CSQ\r\n";
char AT_START_MQTT[] = "AT+CMQTTSTART\r\n";
char AT_ACQUIRE_CLIENT[] = "AT+CMQTTACCQ=0,\"%s\",0\r\n";
//char AT_CONNECT_MQTT[]="AT+CMQTTCONNECT=0,\"%s:%d\",60,1,\"%s\",\"%s\"\r\n";
char AT_CONNECT_MQTT[] = "AT+CMQTTCONNECT=0,\"%s:%d\",60,1,\"%s\",\"%s\"\r\n";

char AT_SET_PUBLISH_TOPIC[] = "AT+CMQTTTOPIC=0,%d\r\n";
char AT_SET_PUBLISH_PAYLOAD[] = "AT+CMQTTPAYLOAD=0,%d\r\n";
char AT_PUBLISH[] = "AT+CMQTTPUB=0,1,60\r\n";
char AT_SUBCRIBE_TOPIC[] = "%s%d\r\n";
char AT_SUBCRIBE[] = "AT+CMQTTSUB=0\r\n";
char AT_COMMAND[200];
char AT_DISCONNECT[] = "AT+CMQTTDISC=0,120";
char BUFFER_TOPPIC_MQTT[200];
char BUFFER_DATA_PAYLOAD_MQTT[100];
//char TOPPIC_PAYLOAD_MQTT[]="{\"WaterLevel\":%.1f}\r\n";
char TOPPIC_PAYLOAD_MQTT[] =
		"{\"WaterLevel\":%.1f,\"_battery_level\":%.1f,\"_gsm_signal_strength\":%d}\r\n";
//char TOPPIC_PAYLOAD_MQTT[]="{\"WaterLevel\":%.1f,\"Battery\":%.1f,\"RSSI\":%.1f}\r\n";
char water[50] = "-123";

int previousTick = 0;
int timeOutConnectA76XX = 40000;
int timeOutConnectMQTT = 40000;
int isATOK = 0;
int isPBDONE = 0;
int payLoadPin, payLoadStatus;

int rxDataCouter = 0;
int numberLoads = 10;
char simcomRxBuffer[100];
int payloadIndex;

uint8_t cnt_1 = 0;
uint8_t rxData;
uint16_t rxIndex;
uint8_t loadflag = 0;
char rxBuffer[50];

uint8_t isConnectSimcomA76xx = 0;
uint8_t isConnectMQTT = 0;
uint8_t sendPayloadStatusToServer;
uint8_t isSleepMode = 0;

//User code sensor distance
uint32_t ICValue = 0;
uint32_t Frequency = 0;
float Duty = 0;
float Distance_water = 0;
uint8_t cnt_start_sleep = 0;
// Flash
float SaveDataWater = 0;
float isDistance = 0;
int intDataWater = 0;
int floatDataWater = 0;
int Negative = 0;
float absChange = 0;
int big_change;

// Query signal quality
float SignalStrength = 0;
// BatteryLevel
uint32_t adcValue = 0;
float BatteryLevel = 0;
float PercentageBattery = 0;
uint32_t arrayBattery[50];
uint32_t temp;
uint8_t times = 10;
//int time_Period=0;
int Filter_Baterry_Values();
int MediumBattery();

uint32_t ADC_VAL;
float Vin = 0;
uint8_t test1 = 0;
uint8_t A7677S_DONE = 0;
uint8_t A7670C_DONE = 0;
// VL53L1
char rx_VL53L1[8];
int distance;
unsigned char data_vl53l1[3] = { 0xA5, 0x15, 0xBA };
unsigned char save_mode[3] = { 0xA5, 0x25, 0xCA };
uint32_t medium_distance[30];
uint32_t temp_distance;
float water_level;
int test123=0;

#if wt53r_ttl
//unsigned char data_w53r_ttl[8] = { 0x50, 0x06, 0x00, 0x03, 0x00, 0x03, 0x34, 0x4A};
unsigned char save_mode_1hz[8] = { 0x50, 0x06, 0x00, 0x03, 0x00, 0x03, 0x34, 0x4A};
unsigned char save_mode_0_2hz[8] = { 0x50, 0x06, 0x00, 0x03, 0x00, 0x06, 0xF4, 0x49};
char rx_wt53r_ttl[80];
char data_w53r_ttl[5];
#endif
int rssi = -99;
void RunningSendData();

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM6_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_ADC_Init(void);
static void MX_TIM2_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */
void turnOnA76XX(void);	//reset module sim A76XX
void sendingToSimcomA76xx(char *cmd);
void Filter_Value(void);
int connectMQTT();
int Sleep_Stm32_A7672S();

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void Flash_Erase(uint32_t address) {
	HAL_FLASH_Unlock();
	FLASH_EraseInitTypeDef EraseInitStruct;
	EraseInitStruct.TypeErase = 1;
	EraseInitStruct.NbPages = 1;
	EraseInitStruct.PageAddress = address;
	EraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
	uint32_t pagerr;
	HAL_FLASHEx_Erase(&EraseInitStruct, &pagerr);
	HAL_FLASH_Lock();
}
void Flash_Write_Init(uint32_t address, int value) {
	HAL_FLASH_Unlock();
	HAL_FLASH_Program(FLASH_TYPEPROGRAMDATA_WORD, address, value);
	HAL_FLASH_Lock();
}
int Flash_Read_Init(uint32_t address) {
	return *(__IO uint16_t*) (address);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == htim6.Instance) {
		// cnt_1++;
	}
}

