kenhkythuat/stm32_rbee/Core/Src/main.c
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
	if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1) // Chon ngat tai channel 1 | cubeMX (PWM input on CH1)
			{
		// Read the IC value
		ICValue = HAL_TIM_ReadCapturedValue(&htim2, TIM_CHANNEL_1); // Do chu ky PWM tu TIM1

		if (ICValue != 0) {
			// calculate the Duty Cycle
			Duty = (float) (HAL_TIM_ReadCapturedValue(&htim2, TIM_CHANNEL_2)
					* 100) / ICValue; // Do do rong xung muc cao
#if tube_length==110
			if (tube_length == 110) {
				Distance_water = 70 - ((Duty * 50) / 10);
			}
#endif
#if tube_length==90
			if (tube_length == 90) {
				Distance_water = 50 - ((Duty * 50) / 10);
			}
#endif
#if tube_length==70
			if (tube_length == 70) {
				Distance_water = 30 - ((Duty * 50) / 10);
			}
#endif
//			else
//			Distance_water=((Duty*50)/10); //don vi CM
			//Frequency = (TIMCLOCK / PRESCALER) / ICValue;
		}
	}
}

int connectSimcomA76xx() {
	//HAL_TIM_Base_Stop_IT(&htim6);
	previousTick = HAL_GetTick();

	while (isConnectSimcomA76xx == 0
			&& (previousTick + timeOutConnectA76XX) > HAL_GetTick()) {
		if (strstr((char*) rxBuffer, "PB DONE")) {
			isPBDONE = 1;
		}
//		if(strstr((char *)rxBuffer,"PDN ACT 1")){
//			A7677S_DONE = 1;
//			isPBDONE=1;
//			HAL_Delay(7000);
//		}
		if (isPBDONE == 1) {
			sendingToSimcomA76xx(ATE0);
			HAL_Delay(200);
			sendingToSimcomA76xx(AT_SIGNAL_SIM);
			HAL_Delay(200);
			SignalStrength = (rxBuffer[8] - 48) * 10 + (rxBuffer[9] - 48);
			if(SignalStrength>=31)
			{
				rssi=-51;
			}else rssi = (SignalStrength * 2 - 113);
			isConnectSimcomA76xx = 1;
			HAL_Delay(1000);
			return isConnectSimcomA76xx;
		}
	}
	if (isConnectSimcomA76xx == 0) {
		NVIC_SystemReset();
	}

	return isConnectSimcomA76xx;
}

//void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
//{
//	if(huart -> Instance == USART1)
//	{
//		if((rxData!='\r')&&(rxData!='\n')){
//			simcomRxBuffer[rxIndex++]=rxData;
//			rxDataCouter++;
//		}
//		else{
//			rxDataCouter=0;
//			rxIndex=0;
//
//		}
//	}
//	HAL_UART_Receive_IT(&huart1, &rxData,1);
//}

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size) {
	if (huart->Instance == USART1) {
		if (strstr((char*) rxBuffer, "ERROR")) {
			NVIC_SystemReset();
		}
		if (strstr((char*) rxBuffer, "unknown")) {
			NVIC_SystemReset();
		}
		HAL_UARTEx_ReceiveToIdle_IT(huart, (uint8_t*) rxBuffer, 50);
	}
	if (huart->Instance == USART2) {
#if vl53l1
		Distance_water = (rx_VL53L1[4] << 8 | rx_VL53L1[5]);
		HAL_UARTEx_ReceiveToIdle_IT(&huart2, (uint8_t*) rx_VL53L1, 8);
#endif
#if wt53r_ttl
		//Distance_water= (char)rx_wt53r_ttl[36];

		sprintf(data_w53r_ttl,"%c%c%c%c",rx_wt53r_ttl[34],rx_wt53r_ttl[35],rx_wt53r_ttl[36],rx_wt53r_ttl[37]);
		Distance_water=atoi(data_w53r_ttl);
		HAL_UARTEx_ReceiveToIdle_IT(&huart2, (uint8_t*) rx_wt53r_ttl, 80);
#endif
	}

}

void sendingToSimcomA76xx(char *cmd) {
	HAL_UART_Transmit(&huart1, (uint8_t*) cmd, strlen(cmd), 1000);
}
void read_vl53l1(uint8_t *data) {
	HAL_UART_Transmit(&huart2, data_vl53l1, 9, 1000);
}
void writte_mode_return_rate(uint8_t *data) {
	HAL_UART_Transmit(&huart2, save_mode_0_2hz, 9, 1000);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM6_Init();
  MX_USART1_UART_Init();
  MX_ADC_Init();
  MX_TIM2_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
	// HAL_TIM_Base_Start_IT(&htim6);
	HAL_GPIO_WritePin(LED_STATUS_GPIO_Port, LED_STATUS_Pin, GPIO_PIN_SET);

	//sendingToSimcomA76xx(AT_RESET);

//  HAL_UART_Receive_IT(&huart1, &rxData,1);
	HAL_UARTEx_ReceiveToIdle_IT(&huart1, (uint8_t*) rxBuffer, 50);
#if vl53l1
	HAL_UARTEx_ReceiveToIdle_IT(&huart2, (uint8_t*) rx_VL53L1, 8);
#endif
#if wt53r_ttl
	HAL_UARTEx_ReceiveToIdle_IT(&huart2, (uint8_t*) rx_wt53r_ttl, 80);
#endif

	intDataWater = Flash_Read_Init(DATA_INT_WATER);
	floatDataWater = Flash_Read_Init(DATA_FLOAT_WATER);
	Negative = Flash_Read_Init(DATA_NEGATIVE_WATER);
	if (Negative == 2) {
		SaveDataWater = ((float) (intDataWater + (float) floatDataWater * 0.1))
				* -1;
	} else {
		SaveDataWater = (float) (intDataWater + (float) floatDataWater * 0.1);
	}
	turnOnA76XX();
	writte_mode_return_rate(save_mode_0_2hz);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1) {

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
		//HAL_GPIO_WritePin(OPEN_SENSOR_GPIO_Port, OPEN_SENSOR_Pin, GPIO_PIN_SET);
		if (!isConnectSimcomA76xx) {
			isConnectSimcomA76xx = connectSimcomA76xx();
		}
		if (!isConnectMQTT) {
			isConnectMQTT = connectMQTT();
		}
		if (!isSleepMode) {
			isSleepMode = Sleep_Stm32_A7672S();
		}
	}
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLLMUL_3;
  RCC_OscInitStruct.PLL.PLLDIV = RCC_PLLDIV_3;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV16;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV16;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_USART2;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_SYSCLK;
  PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_HSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC_Init(void)
{

  /* USER CODE BEGIN ADC_Init 0 */

  /* USER CODE END ADC_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC_Init 1 */

