kenhkythuat/stm32_rbee/Core/Src/main.c
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(OPEN_SENSOR_GPIO_Port, OPEN_SENSOR_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LED_STATUS_GPIO_Port, LED_STATUS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(ENABLE_A7672C_GPIO_Port, ENABLE_A7672C_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin : OPEN_SENSOR_Pin */
  GPIO_InitStruct.Pin = OPEN_SENSOR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(OPEN_SENSOR_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LED_STATUS_Pin ENABLE_A7672C_Pin */
  GPIO_InitStruct.Pin = LED_STATUS_Pin|ENABLE_A7672C_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
int Filter_Baterry_Values() {
	for (int i = 0; i < times; i++) {
		HAL_ADC_Start(&hadc);
		HAL_ADC_PollForConversion(&hadc, 1000);
		HAL_Delay(100);
		arrayBattery[i] = HAL_ADC_GetValue(&hadc);
	}
	adcValue = MediumBattery();
	// vol max 2.1 vol min 1.25
	BatteryLevel = ((float) (adcValue / 4095.00) * 3.3);
	PercentageBattery = ((BatteryLevel / 2.1) * 100);
	if (PercentageBattery > 100) {
		PercentageBattery = 100;
	}
	HAL_ADC_Stop(&hadc);

	return PercentageBattery;
}
int MediumBattery() {
	for (int i = 0; i < times - 1; i++) {
		for (int j = i + 1; j < times; j++) {
			if (arrayBattery[i] > arrayBattery[j]) {

				temp = arrayBattery[i];

				arrayBattery[i] = arrayBattery[j];

				arrayBattery[j] = temp;

			}
		}
	}
	return arrayBattery[times / 2];
}

void turnOnA76XX() {
	HAL_GPIO_WritePin(ENABLE_A7672C_GPIO_Port, ENABLE_A7672C_Pin,
			GPIO_PIN_RESET);
	HAL_Delay(3000);
	HAL_GPIO_WritePin(ENABLE_A7672C_GPIO_Port, ENABLE_A7672C_Pin, GPIO_PIN_SET);
	HAL_Delay(4000);
	HAL_GPIO_WritePin(ENABLE_A7672C_GPIO_Port, ENABLE_A7672C_Pin,
			GPIO_PIN_RESET);
	HAL_Delay(300);
	HAL_GPIO_WritePin(ENABLE_A7672C_GPIO_Port, ENABLE_A7672C_Pin, GPIO_PIN_SET);
	HAL_Delay(3000);
	//Start sensor
	HAL_GPIO_WritePin(OPEN_SENSOR_GPIO_Port, OPEN_SENSOR_Pin, GPIO_PIN_SET);
}
int get_data_sensor(int times)
{
	for (int i = 0; i < times; i++) {
		//read_vl53l1(data_vl53l1);
		HAL_Delay(200);
		medium_distance[i] = Distance_water;
	}
	for (int i = 0; i < times - 1; i++) {
		for (int j = i + 1; j < times; j++) {
			if (medium_distance[i] > medium_distance[j]) {

				temp_distance = medium_distance[i];

				medium_distance[i] = medium_distance[j];

				medium_distance[j] = temp_distance;
			}
		}
	}
	return medium_distance[times/2];
}
int abnormal_sensor_data(int difference)
{
	absChange = fabs(water_level - SaveDataWater);
	if (absChange > difference)
		return 1;
	 else
		return 0;
	//The difference is in cm
}
int connectMQTT(void) {

#if wt53r_ttl
	//test123=get_data_sensor(30);
	water_level = (48.5-(get_data_sensor(30) * 0.1));
#endif
	big_change=abnormal_sensor_data(3);
	if(big_change)
	{
		get_data_sensor(30);
		water_level = (48.5-(get_data_sensor(30) * 0.1));
	}
	Filter_Value();
	HAL_GPIO_WritePin(OPEN_SENSOR_GPIO_Port, OPEN_SENSOR_Pin, GPIO_PIN_RESET);
	sendingToSimcomA76xx(ATE0);
	HAL_Delay(200);
	sendingToSimcomA76xx(AT_START_MQTT);
	HAL_Delay(200);
	sprintf(AT_COMMAND, AT_ACQUIRE_CLIENT, MQTT_CLIENT_ID);
	sendingToSimcomA76xx(AT_COMMAND);
	HAL_Delay(500);
	sprintf(AT_COMMAND, AT_CONNECT_MQTT, MQTT_HOST, MQTT_PORT, MQTT_USER,
	MQTT_PASS);
	sendingToSimcomA76xx(AT_COMMAND);
	HAL_Delay(1000);
	sprintf(BUFFER_TOPPIC_MQTT, "%s/sn/%s", FARM, MQTT_CLIENT_ID);
	sprintf(AT_COMMAND, AT_SET_PUBLISH_TOPIC, (int) strlen(BUFFER_TOPPIC_MQTT));
	sendingToSimcomA76xx(AT_COMMAND);
	HAL_Delay(500);
	sendingToSimcomA76xx(BUFFER_TOPPIC_MQTT);
	HAL_Delay(500);
	Filter_Baterry_Values();
	sprintf(BUFFER_DATA_PAYLOAD_MQTT, TOPPIC_PAYLOAD_MQTT, water_level,
			PercentageBattery, rssi);
//	sprintf(BUFFER_DATA_PAYLOAD_MQTT,TOPPIC_PAYLOAD_MQTT,Distance_water);
	HAL_Delay(500);
	sprintf(AT_COMMAND, AT_SET_PUBLISH_PAYLOAD,
			(int) strlen(BUFFER_DATA_PAYLOAD_MQTT));
	sendingToSimcomA76xx(AT_COMMAND);
	HAL_Delay(500);
	sendingToSimcomA76xx(BUFFER_DATA_PAYLOAD_MQTT);
	HAL_Delay(500);
	sendingToSimcomA76xx(AT_PUBLISH);
	HAL_Delay(500);
	isConnectMQTT = 1;
	return 1;
}
int Sleep_Stm32_A7672S() {
	//Sleep Simcom A7672S

	HAL_GPIO_WritePin(ENABLE_A7672C_GPIO_Port, ENABLE_A7672C_Pin,
			GPIO_PIN_RESET);
	HAL_Delay(4000);
	//sendingToSimcomA76xx("AT+CPOF");
	HAL_GPIO_WritePin(ENABLE_A7672C_GPIO_Port, ENABLE_A7672C_Pin, GPIO_PIN_SET);
	HAL_Delay(6000);
	HAL_GPIO_WritePin(GPIOB, LED_STATUS_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(OPEN_SENSOR_GPIO_Port, OPEN_SENSOR_Pin, GPIO_PIN_RESET);
	HAL_TIM_Base_Start_IT(&htim6);
	//CLose sensor
	//HAL_GPIO_WritePin(GPIOB, LED_STATUS_Pin,GPIO_PIN_RESET);
	HAL_SuspendTick();
	HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFE);
	HAL_ResumeTick();
	NVIC_SystemReset();
	isSleepMode = 1;

	return isSleepMode;
}
void Filter_Value(void) {

	absChange = fabs(water_level - SaveDataWater);
	if (water_level > 0 && absChange > 0.5) {
		Negative = 1;
		isDistance = water_level;
		Flash_Erase(DATA_NEGATIVE_WATER);
		Flash_Write_Init(DATA_NEGATIVE_WATER, (uint32_t) Negative);

		intDataWater = (int) isDistance;
		floatDataWater = ((int) (isDistance * 10) % 10);

		Flash_Erase(DATA_INT_WATER);
		Flash_Write_Init(DATA_INT_WATER, (uint32_t) intDataWater);

		Flash_Erase(DATA_FLOAT_WATER);
		Flash_Write_Init(DATA_FLOAT_WATER, (uint32_t) floatDataWater);
	}
	if (water_level < 0 && absChange > 0.5) {

		Negative = 2;
		isDistance = water_level * -1;
		Flash_Erase(DATA_NEGATIVE_WATER);
		Flash_Write_Init(DATA_NEGATIVE_WATER, (uint32_t) Negative);

		intDataWater = (int) isDistance;
		floatDataWater = ((int) (isDistance * 10) % 10);

		Flash_Erase(DATA_INT_WATER);
		Flash_Write_Init(DATA_INT_WATER, (uint32_t) intDataWater);

		Flash_Erase(DATA_FLOAT_WATER);
		Flash_Write_Init(DATA_FLOAT_WATER, (uint32_t) floatDataWater);
	}
	if (absChange < 0.5) {
		water_level = SaveDataWater;
	}

}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
